{
  "backend/main.mo": "Manages user profiles, app passwords, and unlock sessions with access control and session timeout logic.",
  "feature_evidence.json": "Lists feature evidence metadata mapping features to source files, components, and test IDs.",
  "frontend-file-summaries.txt": "Provides prewritten summaries for various frontend files used in build planning.",
  "frontend/.gitignore": "Gitignore rules for frontend dependencies, builds, environment files, IDE files, OS artifacts, logs, and mobile build outputs.",
  "frontend/android/.gitkeep": "Empty placeholder file to keep the android directory in version control.",
  "frontend/capacitor.config.ts": "Capacitor configuration defining app ID, web output dir, mobile schemes, and plugin settings.",
  "frontend/index.css": "Tailwind base styles with extensive OKLCH color variables for light and dark themes.",
  "frontend/index.html": "Main HTML entry point defining meta tags, PWA manifest, icons, and root mount point.",
  "frontend/ios/.gitkeep": "Empty placeholder file to keep the ios directory in version control.",
  "frontend/MOBILE_RELEASE.md": "Guide describing steps to package and submit the Thunderlab mobile app for iOS and Android.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app name, colors, icons, and startup behavior.",
  "frontend/src/App.tsx": "Sets up React Router routes, theme provider, and wraps the app with layout and notifications.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button handling Internet Identity auth and cache clearing.",
  "frontend/src/components/auth/UnlockGate.tsx": "Route guard that enforces authentication and unlock status while allowing admins to bypass unlocking.",
  "frontend/src/components/layout/AppFooter.tsx": "Renders a footer with the current year and a referral link to caffeine.ai.",
  "frontend/src/components/layout/AppLayout.tsx": "Defines the main app layout including navigation, content outlet, and footer.",
  "frontend/src/components/layout/AppNav.tsx": "Displays navigation with conditional rendering based on authentication and links to key app sections.",
  "frontend/src/components/settings/AppPasswordPanel.tsx": "Provides UI and logic for changing, resetting, and locking the app password using associated hooks.",
  "frontend/src/features/beat-maker/audioEngine.ts": "Implements a Web Audio–based engine to synthesize kick, snare, and hihat sounds and play sequenced steps.",
  "frontend/src/features/beat-maker/renderToWav.ts": "Renders a drum pattern offline into a WAV file using Web Audio and returns the encoded blob and filename.",
  "frontend/src/features/beat-maker/useStepSequencer.ts": "Manages beat‑maker state, pattern editing, playback timing, and interaction with the AudioEngine.",
  "frontend/src/features/beat-maker/wavEncoder.ts": "Encodes an AudioBuffer into a 16‑bit PCM WAV blob by writing headers and interleaving audio data.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and refreshes dependent queries on change.",
  "frontend/src/hooks/useAppPassword.ts": "Manages unlocking and saving the app password by hashing input, calling backend actor methods, and updating unlock-related queries.",
  "frontend/src/hooks/useAppPasswordManagement.ts": "Provides password change, lock, and reset flows using useAppPassword and actor methods, updating queries and navigation accordingly.",
  "frontend/src/hooks/useCallerRole.ts": "Fetches the caller’s backend-defined role and admin status via react-query, defaulting to guest on errors; also provides a simplified admin check hook.",
  "frontend/src/hooks/useCapacitorDeepLinks.ts": "Empty placeholder file for handling Capacitor deep links.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity context and provider for login, identity loading, and status tracking using AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines queries and mutations for fetching and saving the caller’s user profile through the backend actor.",
  "frontend/src/hooks/useUnlockStatus.ts": "Queries whether the current user session is unlocked, defaulting to locked on errors and keying by principal.",
  "frontend/src/index.css": "Tailwind CSS setup defining theme variables for light and dark modes plus base and utility styles.",
  "frontend/src/lib/backendCallWithUnlock.ts": "Wraps backend calls to detect locked errors and redirect to the unlock page while preserving return paths.",
  "frontend/src/lib/lockedError.ts": "Detects backend 'locked' errors by checking common lock-related message strings.",
  "frontend/src/lib/projectAudioImport.ts": "Stub for importing audio into projects, logging request details and throwing until implemented.",
  "frontend/src/lib/returnToContext.ts": "Stores, retrieves, and clears a return-to path in sessionStorage for post-unlock navigation.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider.",
  "frontend/src/pages/BeatMakerPage.tsx": "UI for a beat-making page allowing sequencing, playback, WAV export, and preparing beats for project import.",
  "frontend/src/pages/LoginPage.tsx": "Login page that authenticates with Internet Identity and redirects users based on admin role, while displaying app features and a sign‑in button.",
  "frontend/src/pages/ProjectsPage.tsx": "Displays the user's projects with an empty state prompt and options to create new projects along with basic feature cards.",
  "frontend/src/pages/SettingsPage.tsx": "Settings page showing user profile info, app password management, and an about section for the Thunderlab app.",
  "frontend/src/pages/UnlockPage.tsx": "Account unlock flow handling password entry or creation, with redirects based on auth, admin status, and unlock state.",
  "frontend/src/security/hashAppPassword.ts": "Implements PBKDF2-based password hashing using WebCrypto and returns a hex‑encoded hash.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL parameters across navigation using URLSearchParams and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, color tokens, container settings, and plugin integrations.",
  "project_state.json": "Defines the current Thunderlab project state, including versioning, architectural notes, known issues, and a list of implemented features with associated requirements."
}