{
  "kind": "build_request",
  "title": "Add an in-app beat maker so users can create beats inside Thunderlab",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-26",
      "text": "Add a protected \"Beat Maker\" experience inside Thunderlab that lets an authenticated + unlocked user create a simple drum beat using a step sequencer UI (e.g., Kick/Snare/Hi-Hat rows on a 16-step grid) with transport controls (Play/Stop) and a tempo (BPM) control.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Can you make it so they can create beats through the app"
        ]
      },
      "acceptanceCriteria": [
        "A new Beat Maker entry point is available to signed-in users (and is not shown on the unauthenticated login screen).",
        "Beat Maker includes a step grid where users can toggle steps on/off for at least 3 drum sounds (kick, snare, hi-hat).",
        "Beat Maker includes Play and Stop controls and a BPM control; playback timing changes with BPM.",
        "Beat Maker route/page is guarded by the existing UnlockGate behavior (locked users are redirected to /unlock)."
      ]
    },
    {
      "id": "REQ-27",
      "text": "Provide an in-app audio rendering/export action in Beat Maker that generates an audio file from the current pattern (WAV or similar browser-supported downloadable format) with a clear filename and download button.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Can you make it so they can create beats through the app"
        ]
      },
      "acceptanceCriteria": [
        "User can click an Export/Download button and receive a downloaded audio file that matches the current pattern and BPM.",
        "Exported audio is at least several bars long (enough to loop) and is not silent when steps are enabled.",
        "User-facing export UI text is in English and clearly indicates what will be downloaded."
      ]
    },
    {
      "id": "REQ-28",
      "text": "Integrate Beat Maker output with the existing \"import beats/audio\" workflow by allowing the user to take the generated beat audio and add it into a project as an audio track without requiring external tools (e.g., offer an \"Add to project\" action that reuses the same code path as importing an audio file).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Can you make it so they can create beats through the app"
        ]
      },
      "acceptanceCriteria": [
        "From Beat Maker, the user can initiate an \"Add to project\" action that results in the generated beat being treated equivalently to an imported audio file for project usage (same track type/handling as imported beats).",
        "If the user is not currently in a project context, the UI provides a clear next step in English (e.g., navigate to Projects to pick/create a project) without crashing.",
        "The app remains usable on mobile screens (touch-friendly step toggles and controls)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor (all logic in backend/main.mo); add backend changes only if strictly required.",
    "Do not edit files under frontend/src/components/ui or any frontend immutablePaths listed in SYSTEM_CONTEXT; compose existing UI components instead.",
    "All user-facing text introduced for Beat Maker must be in English.",
    "Beat Maker must respect existing authentication + unlock gating (use the current UnlockGate pattern for protected routes/pages)."
  ],
  "nonGoals": [
    "Full DAW-grade MIDI editor, piano roll, or melody/harmony composition tools.",
    "AI-assisted beat generation or third-party sample pack integrations.",
    "Real-time collaboration or shared beat sessions."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}