{
  "kind": "build_request",
  "title": "Fix Create Project button doing nothing after login",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-32",
      "text": "Make project creation actionable from the Projects page by wiring the \"New Project\" and \"Create Your First Project\" buttons to a real create-project flow instead of doing nothing.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-6"
        ],
        "quotes": [
          "But I can’t create project",
          "Got in pressed create project nothing can up"
        ]
      },
      "acceptanceCriteria": [
        "On /projects, clicking either call-to-action (\"New Project\" or \"Create Your First Project\") triggers an immediate visible UI response (e.g., opens a create dialog or navigates to a create-project screen) rather than doing nothing.",
        "If the user is not authenticated or becomes locked, the existing guard behavior applies (redirect to / or /unlock as appropriate) and the user is not left on an unresponsive screen.",
        "If project creation fails for any reason, the UI shows a clear English error message and provides a retry path."
      ]
    },
    {
      "id": "REQ-33",
      "text": "Implement a minimal, user-visible create-project UX that lets the user create a new project and then lands them in the project workspace (or the closest existing project screen), with clear loading feedback during creation.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Got in pressed create project nothing can up"
        ]
      },
      "acceptanceCriteria": [
        "The create-project UX collects at least a project name (or uses a sensible default like \"Untitled Project\" if name entry is optional) and provides a Create/Cancel path.",
        "While the project is being created, the UI shows a loading/disabled state so the user cannot repeatedly click and think nothing is happening.",
        "After success, the app navigates the user to the created project's screen/workspace and the new project is visible in the projects list when returning to /projects."
      ]
    },
    {
      "id": "REQ-34",
      "text": "Ensure the backend exposes and/or correctly handles the project creation operation used by the Projects page (create + list at minimum) so that project creation actually persists to the user account and survives refresh.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Got in pressed create project nothing can up"
        ]
      },
      "acceptanceCriteria": [
        "There is a backend method to create a project for the authenticated caller and return the created project's identifier.",
        "There is a backend method to list the caller's projects so the Projects page can render them after creation.",
        "Authorization is enforced: only authenticated users can create/list projects; for sensitive operations, preserve the existing unlock-gated security model (non-admin users must be unlocked)."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (read-only UI components).",
    "Do not edit frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, or frontend/src/main.tsx (immutable paths).",
    "Backend must remain a single Motoko actor in backend/main.mo; only add backend/migration.mo if an actual state upgrade/migration is required."
  ],
  "nonGoals": [
    "Do not add new audio features (recording/effects/export/sharing) beyond what is required to make Create Project functional.",
    "Do not add third-party authentication providers or external databases/services."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}