{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Wire Projects CTAs to a functional create-project flow",
  "requirements": [
    {
      "id": "REQ-32",
      "summary": "Make Projects page CTAs trigger a real create-project action with visible feedback and proper auth/lock handling.",
      "acceptanceCriteria": [
        "On /projects, clicking either call-to-action (\"New Project\" or \"Create Your First Project\") triggers an immediate visible UI response (e.g., opens a create dialog or navigates to a create-project screen) rather than doing nothing.",
        "If the user is not authenticated or becomes locked, the existing guard behavior applies (redirect to / or /unlock as appropriate) and the user is not left on an unresponsive screen.",
        "If project creation fails for any reason, the UI shows a clear English error message and provides a retry path."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ProjectsPage.tsx",
          "operation": "modify",
          "description": "Wire both \"New Project\" and \"Create Your First Project\" buttons to open a modal create-project UI (immediate visible response). Use shadcn-ui Dialog/Input/Button components (read-only imports from frontend/src/components/ui/*; do not modify them). Hook into the authorization component’s auth/lock model by calling backend functions through a wrapper that redirects on locked errors (Verify the component's usage instructions before implementing). Add clear error messaging on failure plus a retry action."
        },
        {
          "path": "frontend/src/hooks/useProjects.ts",
          "operation": "create",
          "description": "Add React Query hooks for listing projects and creating a project via the existing actor (listProjects/createProject). Wrap calls with backendCallWithUnlock so locked users are redirected to /unlock and don’t remain on an unresponsive screen. Surface errors in a user-friendly way to the caller so the UI can show clear English errors and offer retry. (Verify the component's usage instructions before implementing)."
        }
      ]
    },
    {
      "id": "REQ-33",
      "summary": "Implement a minimal create-project UX (name + create/cancel) with loading state and navigation to the created project screen.",
      "acceptanceCriteria": [
        "The create-project UX collects at least a project name (or uses a sensible default like \"Untitled Project\" if name entry is optional) and provides a Create/Cancel path.",
        "While the project is being created, the UI shows a loading/disabled state so the user cannot repeatedly click and think nothing is happening.",
        "After success, the app navigates the user to the created project's screen/workspace and the new project is visible in the projects list when returning to /projects."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ProjectWorkspacePage.tsx",
          "operation": "create",
          "description": "Create a minimal project workspace screen routed by project id that can serve as the post-create landing page (closest existing workspace). It should fetch the current project list (via the new useProjects hook) to resolve and display the created project name and provide an obvious way back to /projects. Keep it guarded by the existing authorization/UnlockGate flow. (Verify the component's usage instructions before implementing)."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Register and wire a protected route for the new project workspace page (e.g., under /projects/$projectId) wrapped with UnlockGate, ensuring navigation after create is possible and remains consistent with the authorization component’s auth/unlock model. (Verify the component's usage instructions before implementing)."
        },
        {
          "path": "frontend/src/pages/ProjectsPage.tsx",
          "operation": "modify",
          "description": "Implement the create modal flow: collect a project name (default to \"Untitled Project\" if empty), show loading/disabled state during creation, and on success navigate to the created project workspace route. Also render the projects list from backend (via useProjects) so the newly created project is visible when returning to /projects. Use Sonner toast for success/error with a retry action where appropriate. (Verify the component's usage instructions before implementing)."
        }
      ]
    }
  ]
}